const pageContent = {
    'index': {
        title: '',
        text: '<div class="custom-text">Всем привет, это мы - счастливые пирожочки Гай и Ричи, но такими мы были не всегда - на этом сайте вы сможете ознакомиться с нашей историей, а пока спорим, кто будет чухать за хохолочком. </div>',
        images: ['index1.jpg', 'index2.jpg']
    },
    'history': {
        title: ' ',
        sections: [
            {
        title: '<div class="history-title">Начало. </div>',
        text: '<div class="history-text">Это Гай и Ричи совсем малыши, буквально несколько дней как появились у нас дома. Посмотрите на эти забавные хохолочки и птенчиковую привычку сидеть в миске с едой, потому что она напоминает гнездо. Да, малявки-попугаи так делают, проходит с возрастом. </div>',
        images: ['history1.jpg', 'history1.1.jpg']
           },
           {
        title: '<div class="history-title">Освоение квартиры. </div>',
        text: '<div class="history-text">На данных фотографиях мы можем заметить, как попугаи пытаются спрятаться от незнакомого им человека, притворяясь настенными светильниками. На что только не готовы эти пернатые, лишь бы их не трогали. </div>',
        images: ['history2.jpg', 'history2.2.jpg']
           }
        ]
    },
    'contacts': {
        title: ' ',
        text: '<div class="custom-text">Этот сайт был создан в 2025году как учебный проект по веб-разработке. </div>',
        table: [
            ['Электронная почта', 'kirill316@bk.ru'],
            ['Электронная почта', 'kirill316@bk.ru']
        ]
    }
};